Tekla Open API Reference for Tekla Structures 2025
BoltCircle Properties
The BoltCircle type exposes the following members.
Properties
Name | Description
BlindHoleDepth
 Gets or sets the blind hole depth.
 (Inherited from BoltGroup.)
Bolt
 Indicates whether the instance is a bolt or just a hole.
 (Inherited from BoltGroup.)
BoltHolesAttributes
 The bolt holes attributes.
 (Inherited from BoltGroup.)
BoltPositions
 Gets the single bolt positions. All the bolt positions are in the XY-plane defined by the bolt group coordinate system. The given positions are in relation to the transformation plane in which the bolt group was selected.
 (Inherited from BoltGroup.)
BoltSize
 The size of the bolts in the group.
 (Inherited from BoltGroup.)
BoltStandard
 The standard of the bolt group.
 (Inherited from BoltGroup.)
BoltType
 The type of the bolt group.
 (Inherited from BoltGroup.)
ConnectAssemblies
 Defines whether to connect a part or an assembly as a secondary part (false) or as a sub-assembly (true).
 (Inherited from BoltGroup.)
CutLength
 The cut length.
 (Inherited from BoltGroup.)
Diameter
 The diameter of the circle.
EndPointOffset
 The end point offset values of the bolt group.
 (Inherited from BoltGroup.)
ExtraLength
 The extra length for the bolts.
 (Inherited from BoltGroup.)
FirstPosition
 The first position point.
 (Inherited from BoltGroup.)
Hole1
 Indicates whether the hole 1 is used.
 (Inherited from BoltGroup.)
Hole2
 Indicates whether the hole 2 is used.
 (Inherited from BoltGroup.)
Hole3
 Indicates whether the hole 3 is used.
 (Inherited from BoltGroup.)
Hole4
 Indicates whether the hole 4 is used.
 (Inherited from BoltGroup.)
Hole5
 Indicates whether the hole 5 is used.
 (Inherited from BoltGroup.)
HoleType
 The special hole type: oversized, slotted, blind or no hole.
 (Inherited from BoltGroup.)
Identifier
 The identifier of the object.
 (Inherited from Object.)
IsUpToDate
Gets if the object does not have a modification which is not shared.
 (Inherited from ModelObject.)
Length
 The length. An extra variable that is only set when the bolt group is made of studs instead of bolts.
 (Inherited from BoltGroup.)
ModificationTime
Gets latest time of the object was modified or created.
 (Inherited from ModelObject.)
NumberOfBolts
 The number of bolts in the circle.
Nut1
 Indicates whether the nut 1 is used in the assembly.
 (Inherited from BoltGroup.)
Nut2
 Indicates whether the nut 2 is used in the assembly.
 (Inherited from BoltGroup.)
OtherPartsToBolt
 The other parts to be bolted (read-only).
 (Inherited from BoltGroup.)
PartToBeBolted
 The part to be bolted.
 (Inherited from BoltGroup.)
PartToBoltTo
 The part to bolt to.
 (Inherited from BoltGroup.)
PlainHoleType
 Gets or sets the plain hole type.
 (Inherited from BoltGroup.)
Position
 The position attributes.
 (Inherited from BoltGroup.)
RotateSlots
 Gets or sets the rotation of the slots: odd, even or parallel.
 (Inherited from BoltGroup.)
SecondPosition
 The second position point.
 (Inherited from BoltGroup.)
SlotOffsetX
 Gets or sets the slotted hole offset X.
 (Inherited from BoltGroup.)
SlotOffsetY
 Gets or sets the slotted hole offset Y.
 (Inherited from BoltGroup.)
SlottedHoleX
 Gets or sets the X allowance of the slotted hole.
 (Inherited from BoltGroup.)
SlottedHoleY
 Gets or sets the Y allowance of the slotted hole.
 (Inherited from BoltGroup.)
StartPointOffset
 The start point offset values of the bolt group.
 (Inherited from BoltGroup.)
ThreadInMaterial
 Whether the thread goes inside the materal or not.
 (Inherited from BoltGroup.)
Tolerance
 The hole tolerance.
 (Inherited from BoltGroup.)
Washer1
 Indicates whether the washer 1 is used in the assembly.
 (Inherited from BoltGroup.)
Washer2
 Indicates whether the washer 2 is used in the assembly.
 (Inherited from BoltGroup.)
Washer3
 Indicates whether the washer 3 is used in the assembly.
 (Inherited from BoltGroup.)
Top
See Also
Reference
BoltCircle Class
Tekla.Structures.Model Namespace